haiprotn/esp32iot/sdkconfig.defaults.esp32c3
# sdkconfig.defaults.esp32c3 — Cấu hình riêng cho ESP32-C3
# Được merge với sdkconfig.defaults khi build cho target esp32c3

# ─── Target ───────────────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32c3"

# ─── CPU ──────────────────────────────────────────────────────────────────────
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y

# ─── Flash Mode ───────────────────────────────────────────────────────────────
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ─── USB Serial JTAG ──────────────────────────────────────────────────────────
# ESP32-C3 có USB JTAG tích hợp — bật để dùng espflash qua USB
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# ─── BLE ──────────────────────────────────────────────────────────────────────
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# ─── Power Management ─────────────────────────────────────────────────────────
# Thiết bị điện AC — không cần power saving
CONFIG_PM_ENABLE=n
